Revit 2026 API

# UnitsIsModifiableSpec Method

---

Checks whether the default FormatOptions can be modified for a given spec.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsModifiableSpec(
	ForgeTypeId specTypeId
)
```
```vb
Public Shared Function IsModifiableSpec (
	specTypeId As ForgeTypeId
) As Boolean
```
```cpp
public:
static bool IsModifiableSpec(
	ForgeTypeId^ specTypeId
)
```
```fsharp
static member IsModifiableSpec :
        specTypeId : ForgeTypeId -> bool
```

#### Parameters

specTypeId ForgeTypeId
     Identifier of the spec to check.

#### Return Value

Boolean True if the FormatOptions can be modified, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The Units class stores a FormatOptions object for every spec, but not all of them can be directly modified. Some have fixed definitions.

#### Reference

Units Class

Autodesk.Revit.DB Namespace